I use the latest version of your Terraform module and the Terraform AWS Provider, but I still get the following error message during the first execution. 

```
Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + plan_arn     = (known after apply)
  + plan_id      = (known after apply)
  + plan_role    = "aws-backup-plan-confluence-efs-dev-role"
  + plan_version = (known after apply)
  + vault_arn    = (known after apply)
  + vault_id     = (known after apply)
aws_backup_vault_notifications.backup_events[0]: Creating...
aws_iam_policy.ab_tag_policy[0]: Creating...
aws_backup_vault.ab_vault[0]: Creating...
aws_iam_role.ab_role[0]: Creating...
aws_sns_topic_policy.backup_events[0]: Creating...
aws_sns_topic_policy.backup_events[0]: Creation complete after 0s [id=arn:aws:sns:eu-west-1:_REDACTED_:atlassian-dev]
aws_backup_vault.ab_vault[0]: Creation complete after 0s [id=confluence-efs-dev]
aws_backup_plan.ab_plan[0]: Creating...
aws_iam_policy.ab_tag_policy[0]: Creation complete after 0s [id=arn:aws:iam::_REDACTED_:policy/terraform-20230316125608564500000001]
aws_iam_role.ab_role[0]: Creation complete after 1s [id=aws-backup-plan-confluence-efs-dev-role]
aws_iam_role_policy_attachment.ab_restores_policy_attach[0]: Creating...
aws_iam_role_policy_attachment.ab_policy_attach[0]: Creating...
aws_iam_role_policy_attachment.ab_restores_s3_policy_attach[0]: Creating...
aws_iam_role_policy_attachment.ab_tag_policy_attach[0]: Creating...
aws_iam_role_policy_attachment.ab_backup_s3_policy_attach[0]: Creating...
aws_backup_plan.ab_plan[0]: Creation complete after 1s [id=384fe60b-7795-4965-acac-c22fb303e76c]
aws_backup_selection.ab_selection[0]: Creating...
aws_iam_role_policy_attachment.ab_restores_policy_attach[0]: Creation complete after 0s [id=aws-backup-plan-confluence-efs-dev-role-20230316125609713000000002]
aws_iam_role_policy_attachment.ab_policy_attach[0]: Creation complete after 0s [id=aws-backup-plan-confluence-efs-dev-role-20230316125609747100000003]
aws_iam_role_policy_attachment.ab_backup_s3_policy_attach[0]: Creation complete after 0s [id=aws-backup-plan-confluence-efs-dev-role-20230316125609920700000005]
aws_iam_role_policy_attachment.ab_tag_policy_attach[0]: Creation complete after 0s [id=aws-backup-plan-confluence-efs-dev-role-20230316125609880800000004]
aws_iam_role_policy_attachment.ab_restores_s3_policy_attach[0]: Creation complete after 0s [id=aws-backup-plan-confluence-efs-dev-role-20230316125610055200000006]
aws_backup_selection.ab_selection[0]: Still creating... [10s elapsed]
aws_backup_selection.ab_selection[0]: Creation complete after 16s [id=8651407d-fda3-4f9d-9a96-ab002eca6bff]
╷
│ Error: creating Backup Vault Notifications (): AccessDeniedException:
│     status code: 403, request id: 2798bf61-078a-444c-99c5-44351c6ff72e
│
│   with aws_backup_vault_notifications.backup_events[0],
│   on notifications.tf line 25, in resource "aws_backup_vault_notifications" "backup_events":
│   25: resource "aws_backup_vault_notifications" "backup_events" {
│
╵
Releasing state lock. This may take a few moments...
ERRO[0253] Terraform invocation failed in /Users/dhoppe/Customers/_REDACTED_/terragrunt-aws-atlassian/stacks/dev/eu-west-1/confluence/backup-efs/.terragrunt-cache/Ro3DBHOF6qpDMG2Jsl9ycjgJsFQ/_-OUS7IrbkPEuqn34kmlQEv67F8  prefix=[/Users/dhoppe/Customers/_REDACTED_/terragrunt-aws-atlassian/stacks/dev/eu-west-1/confluence/backup-efs]
ERRO[0253] Module /Users/dhoppe/Customers/_REDACTED_/terragrunt-aws-atlassian/stacks/dev/eu-west-1/confluence/backup-efs has finished with an error: 1 error occurred:
    * exit status 1
  prefix=[/Users/dhoppe/Customers/_REDACTED_/terragrunt-aws-atlassian/stacks/dev/eu-west-1/confluence/backup-efs]
ERRO[0253] 1 error occurred:
    * exit status 1
```

During the second execution everything works as expected, but I did not had this issue using my pull request. 
```
Terraform will perform the following actions:

  # aws_backup_vault_notifications.backup_events[0] will be created
  + resource "aws_backup_vault_notifications" "backup_events" {
      + backup_vault_arn    = (known after apply)
      + backup_vault_events = [
          + "BACKUP_JOB_COMPLETED",
        ]
      + backup_vault_name   = "confluence-efs-dev"
      + id                  = (known after apply)
      + sns_topic_arn       = "arn:aws:sns:eu-west-1:_REDACTED_:atlassian-dev"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_backup_vault_notifications.backup_events[0]: Creating...
aws_backup_vault_notifications.backup_events[0]: Creation complete after 0s [id=confluence-efs-dev]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```